blog/best-programming-language-for-beginner.essay.org
#+TITLE: Which Programming Language Should I Learn First?
#+DATE: <2020-06-25 Thu>
#+SUBTITLE: The Right Tool for the Job
#+LANGUAGE: en
#+DESCRIPTION: How to pick your first programming language to learn coding
#+KEYWORDS: learn programming, learn to code, programming languages, best programming language
#+HTML_HEAD_EXTRA: <link rel="canonical" href="https://monkeyjunglejuice.github.io/blog/best-programming-language-for-beginner.essay.html">
#+SETUPFILE: ../static/setup.org
#+PROPERTY: header-args+ :eval no-export
#+OPTIONS:

#+TOC: headlines 2

* What is this about?

I'm going to explain what's important for a first programming language from a beginner's perspective, clear up common misconceptions, review the most interesting languages with their pros/cons, and point to the best (free) learning resources and books.

#+ATTR_HTML: :cite https://www.cs.utexas.edu/users/EWD/transcriptions/OtherDocs/Haskell.html
#+begin_quote
»It is not only the violin that shapes the violinist, we are all shaped by the tools we train ourselves to use, and in this respect programming languages have a devious influence: they shape our thinking habits. This circumstance makes the choice of first programming language so important.«
@@html:<cite>@@—[[https://www.cs.utexas.edu/users/EWD/transcriptions/OtherDocs/Haskell.html][Edsger W.Dijkstra]]@@html:</cite>@@
#+end_quote

* The hard Part

"Learning a programming language" applies foremost to programmers who already know how to program. For them, picking up a new language is possible within a couple of weeks (and for you too, once you've gained some experience).

But if you start out, you don't need to just learn a programming language; as a beginner:

1. You will have to learn *the language itself* with it's features, syntax, semantics and … warts. I would say this is the easiest thing of the three.

2. Then you want to learn *how to program*. It means learning how to analyze the problems you want to tackle, finding solutions and express them in algorithms and data structures, which is often not intuitive. For that, you're utilizing the various ways your programming langugage provides.

3. And there's *the technology part*, e. g. things like protocols, networking, cryptography, the platform or operating system, tooling and the language ecosystem. This is a vast ocean of knowledge, which requires some specialization.

* What do You Want to Do?

Is it your plan to become a software developer? Software is built in different domains – the most prominently spoken about within the www, is obviously the development of ... itself. Big surprise. But there are other areas than web frontend and web backend; like fintech, games, aircraft systems, robotics, telecom or water supply. If you know exactly what your intentions are, you could start with a language of your specific field and go form there … or better not?

#+ATTR_HTML: :cite https://www.cs.cornell.edu/courses/cs3110/2021sp/textbook/intro/pl.html
#+BEGIN_QUOTE
»It's crucial that you understand the principles behind programming that transcend the specifics of any specific language.«
@@html:<cite>@@—[[https://www.cs.cornell.edu/courses/cs3110/2021sp/textbook/intro/pl.html][Michael R. Clarkson]]@@html:</cite>@@
#+END_QUOTE

The industry workhorse may probably not be the right fit, because it could be either highly specific and/or come with a lot of distracting things that don't matter for you right now. There's a reason one does not take the very first driving lessons on a bucket wheel excavator, but on a ... yes, a car. Or motorbike. If you pick the wrong one, you might not follow through.

Life changes and programming is hard. So you should go with a language that's interesting to you – for whatever reason – and which is particularly suitable for learning, according to the criteria I lay out below. The more curious and interested you are, the deeper you  can immerse yourseld, and this directly influences your capacity to understand. Read on, I will describe the most interesting languages afterwards.

You may even want to learn programming, if you have no plans to become a part of the software producing workforce. I've worked quite a long time as a designer and in the online marketing industry, but have barely written any code at all, since there were always developers working alongside me and tasked with the wizardry.

But I have always been interested in computer stuff, so I've dabbled a lot with Linux, server administration and tweaking/breaking my configs as a means of procrastination. Real programming was the magical border I haven't crossed – until recently.

For my part, I wanted a tool to structure and formalize thoughts, and I'd like to be able to prototype ideas. More generally, I think programming can help us tremendously to develop our minds.

#+BEGIN_QUOTE
»Life is short – pull down the curtain, cast some spells and wield some magic!«
#+END_QUOTE

* What makes a Programming Language beginner-friendly?

