blog/best-programming-language-for-beginner.essay.org
** Available Learning Material

For which programming language is the right learning material available? That point is huge!

Most programming books or courses are not made for absolute beginners, but for programmers who want to /learn yet another language/. Remember, you want to /learn programming/, not just a language.

"Regular" programming books are not "too advanced" to grasp; it's just that they *teach you the wrong things* instead of what you actually need to learn.

Beware, there's also a lot of crap out there. And the more popular a programming language, the more crap you'll run into. First, learn how to learn things by yourself, in ways that fit your preferences and unique cognitive predispositions. That is likely the most valuable skill you'll ever develop.

I recommend a textbook or e-textbook *with exercises* as your main forge of knowledge, because books are still the most accessible media – you can read a chapter even if you're queueing up somewhere, re-read each chapter until you got it, and /do the exercises/.

Generally, I suggest to use material from university profs and/or other reputable personalities to make sure you adopt a well rounded foundation and good style, instead of jumping between random tutorials and wasting money on bootcamps.

I've linked the best books below. Most of them come for free! Get ready to dabble with your textbook for quite some time. /So you really want an enjoyable one!/ The most recommended book may not neccesarily be the right one for you; individual taste matters a lot.

** Syntax and Readability

As a novice coder, you'll need enough brain capacity left to maintain focus on the concepts and what (your) code does, without the language getting in your way. So you want a simple syntax that's easy to pick up and remember. You don't want surprises and gotchas.

Code is also more often read than written. A clean syntax enables the you to understand what's going on in the program. Consistency enables you to derive further things from things you already have learned before and speeds up your learning process. [[https://cs.lmu.edu/~ray/notes/syntaxdesign/][Side read: Here's a nice overview that explains certain features a syntax can have, and how they affect the perception of code.]]

** Expressive Power

Expressivity means how simple it is to say certain things. There are a some factors who determine how expressive a programming language can be:

*** Expressions, Statements or a mix of both?

One feature to look for is if a language has expressions only or if it mixes both expressions and statements.

For sanity's sake, go for a language where *"everything is an expression"*. The reason for this is that expressions can be nested, so anything in the language can be combined with nearly evertything else.

Languages that have both -- expressions and statements -- tend to be clumsy, because some constructs are expressions, some are statements and both cannot be nested/combined as you see fit, so you run into silly barriers all the time and need to structure your code around those artificial limitations.

*** Low-level or High-level?

Low-level does not mean "worse" or "inferior" than high-level – it just refers to the fact that computers are built in many layers on top of each other, and the levels close to the physical machine are called the "low level". You could also call it "foundation", if you prefer a less judgemental sounding term xP

High-level languages tend to be more expressive than low-level languages, because with each layer up, the grade of /abstraction/ increases and more powerful ways to express complex things come into play.

*** How simple is it to build Abstractions?

What is abstraction? It means hiding the foundational workings of the level(s) below (eg. the physical machine) so you don't have to deal with them directly and can focus on your problem/idea instead.

An analogy: A console used to control the lightshow of a concert is an abstraction over fumbling with the electricity cables and tieing them together to make light bulbs glow in a certain order. Now think about doing the light show only by messing with the wires. This is dangerous and way harder (practically impossible) than using the console.

And so it is with programming, too. That's why no one is coding directly in 010010101, CPU instructions or Assembly language to build apps.

*** Is it a wordy or concise Language?

Do you have to write a lot of boilerplate or repeat yourself? In most cases you want an expressive high-level language; not overly verbose but also not too terse, so there's just the right amount of redundancy left to keep it comprehensible. [[https://redmonk.com/dberkholz/2013/03/25/programming-languages-ranked-by-expressiveness/][Side-read: programming languages ranked by their expressiveness]]

** Usability and Programming Environment

Ideally, your language of choice comes with tooling that's easy to use. 'Tooling' includes things like editor support (syntax highlighting, "jump-to-definition", looking up documentation), helpful (or at least comprehensible) error messages, compilers, build systems and package management for libraries.

Libraries are pieces of code written by other programmers that can be re-used, so a developer has less work and doesn't need to code everything from scratch. A good selection of libraries means basically "less work". Having many libraries is desirable for industrial use, but it doesn't matter so much in the beginning. Many languages can also use libraries from other programming languages/ecosystems.

Consider to pick a language that comes with a /[[https://mikelevins.github.io/posts/2020-12-18-repl-driven/][REPL]]/, sometimes called /toplevel/ to run single pieces of your code interactively. Well, nowadays many languages come with a "REPL". But just a few languages enable true /interactive development/, a.k.a. /conversational programming/.

Can you get started without huge ceremonies and fumbling for days?

