blog/best-programming-language-for-beginner.essay.html
<div id="outline-container-org0829375" class="outline-3">
<h3 id="org0829375"><a href="#org0829375">Available Learning Material</a></h3>
<div class="outline-text-3" id="text-org0829375">
<p>
For which programming language is the right learning material available? That point is huge!<br>
</p>

<p>
Most programming books or courses are not made for absolute beginners, but for programmers who want to <i>learn yet another language</i>. Remember, you want to <i>learn programming</i>, not just a language.<br>
</p>

<p>
&ldquo;Regular&rdquo; programming books are not &ldquo;too advanced&rdquo; to grasp; it&rsquo;s just that they <b>teach you the wrong things</b> instead of what you actually need to learn.<br>
</p>

<p>
Beware, there&rsquo;s also a lot of crap out there. And the more popular a programming language, the more crap you&rsquo;ll run into. First, learn how to learn things by yourself, in ways that fit your preferences and unique cognitive predispositions. That is likely the most valuable skill you&rsquo;ll ever develop.<br>
</p>

<p>
I recommend a textbook or e-textbook <b>with exercises</b> as your main forge of knowledge, because books are still the most accessible media – you can read a chapter even if you&rsquo;re queueing up somewhere, re-read each chapter until you got it, and <i>do the exercises</i>.<br>
</p>

<p>
Generally, I suggest to use material from university profs and/or other reputable personalities to make sure you adopt a well rounded foundation and good style, instead of jumping between random tutorials and wasting money on bootcamps.<br>
</p>

<p>
I&rsquo;ve linked the best books below. Most of them come for free! Get ready to dabble with your textbook for quite some time. <i>So you really want an enjoyable one!</i> The most recommended book may not neccesarily be the right one for you; individual taste matters a lot.<br>
</p>
</div>
</div>
<div id="outline-container-orgacf63aa" class="outline-3">
<h3 id="orgacf63aa"><a href="#orgacf63aa">Syntax and Readability</a></h3>
<div class="outline-text-3" id="text-orgacf63aa">
<p>
As a novice coder, you&rsquo;ll need enough brain capacity left to maintain focus on the concepts and what (your) code does, without the language getting in your way. So you want a simple syntax that&rsquo;s easy to pick up and remember. You don&rsquo;t want surprises and gotchas.<br>
</p>

<p>
Code is also more often read than written. A clean syntax enables the you to understand what&rsquo;s going on in the program. Consistency enables you to derive further things from things you already have learned before and speeds up your learning process. <a href="https://cs.lmu.edu/~ray/notes/syntaxdesign/">Side read: Here&rsquo;s a nice overview that explains certain features a syntax can have, and how they affect the perception of code.</a><br>
</p>
</div>
</div>
<div id="outline-container-org2378c49" class="outline-3">
<h3 id="org2378c49"><a href="#org2378c49">Expressive Power</a></h3>
<div class="outline-text-3" id="text-org2378c49">
<p>
Expressivity means how simple it is to say certain things. There are a some factors who determine how expressive a programming language can be:<br>
</p>
</div>
<div id="outline-container-org2164517" class="outline-4">
<h4 id="org2164517"><a href="#org2164517">Expressions, Statements or a mix of both?</a></h4>
<div class="outline-text-4" id="text-org2164517">
<p>
One feature to look for is if a language has expressions only or if it mixes both expressions and statements.<br>
</p>

<p>
For sanity&rsquo;s sake, go for a language where <b>&ldquo;everything is an expression&rdquo;</b>. The reason for this is that expressions can be nested, so anything in the language can be combined with nearly evertything else.<br>
</p>

<p>
Languages that have both &#x2013; expressions and statements &#x2013; tend to be clumsy, because some constructs are expressions, some are statements and both cannot be nested/combined as you see fit, so you run into silly barriers all the time and need to structure your code around those artificial limitations.<br>
</p>
</div>
</div>
<div id="outline-container-orgc4f9583" class="outline-4">
<h4 id="orgc4f9583"><a href="#orgc4f9583">Low-level or High-level?</a></h4>
<div class="outline-text-4" id="text-orgc4f9583">
<p>
Low-level does not mean &ldquo;worse&rdquo; or &ldquo;inferior&rdquo; than high-level – it just refers to the fact that computers are built in many layers on top of each other, and the levels close to the physical machine are called the &ldquo;low level&rdquo;. You could also call it &ldquo;foundation&rdquo;, if you prefer a less judgemental sounding term xP<br>
</p>

<p>
High-level languages tend to be more expressive than low-level languages, because with each layer up, the grade of <i>abstraction</i> increases and more powerful ways to express complex things come into play.<br>
</p>
</div>
</div>
<div id="outline-container-orgad04bd2" class="outline-4">
<h4 id="orgad04bd2"><a href="#orgad04bd2">How simple is it to build Abstractions?</a></h4>
<div class="outline-text-4" id="text-orgad04bd2">
<p>
What is abstraction? It means hiding the foundational workings of the level(s) below (eg. the physical machine) so you don&rsquo;t have to deal with them directly and can focus on your problem/idea instead.<br>
</p>

<p>
An analogy: A console used to control the lightshow of a concert is an abstraction over fumbling with the electricity cables and tieing them together to make light bulbs glow in a certain order. Now think about doing the light show only by messing with the wires. This is dangerous and way harder (practically impossible) than using the console.<br>
</p>

<p>
And so it is with programming, too. That&rsquo;s why no one is coding directly in 010010101, CPU instructions or Assembly language to build apps.<br>
</p>
</div>
</div>
<div id="outline-container-orgbf18204" class="outline-4">
<h4 id="orgbf18204"><a href="#orgbf18204">Is it a wordy or concise Language?</a></h4>
<div class="outline-text-4" id="text-orgbf18204">
<p>
Do you have to write a lot of boilerplate or repeat yourself? In most cases you want an expressive high-level language; not overly verbose but also not too terse, so there&rsquo;s just the right amount of redundancy left to keep it comprehensible. <a href="https://redmonk.com/dberkholz/2013/03/25/programming-languages-ranked-by-expressiveness/">Side-read: programming languages ranked by their expressiveness</a><br>
</p>
</div>
</div>
</div>
<div id="outline-container-org3d60b24" class="outline-3">
<h3 id="org3d60b24"><a href="#org3d60b24">Usability and Programming Environment</a></h3>
<div class="outline-text-3" id="text-org3d60b24">
<p>
Ideally, your language of choice comes with tooling that&rsquo;s easy to use. &rsquo;Tooling&rsquo; includes things like editor support (syntax highlighting, &ldquo;jump-to-definition&rdquo;, looking up documentation), helpful (or at least comprehensible) error messages, compilers, build systems and package management for libraries.<br>
</p>

<p>
Libraries are pieces of code written by other programmers that can be re-used, so a developer has less work and doesn&rsquo;t need to code everything from scratch. A good selection of libraries means basically &ldquo;less work&rdquo;. Having many libraries is desirable for industrial use, but it doesn&rsquo;t matter so much in the beginning. Many languages can also use libraries from other programming languages/ecosystems.<br>
</p>

<p>
Consider to pick a language that comes with a <i><a href="https://mikelevins.github.io/posts/2020-12-18-repl-driven/">REPL</a></i>, sometimes called <i>toplevel</i> to run single pieces of your code interactively. Well, nowadays many languages come with a &ldquo;REPL&rdquo;. But just a few languages enable true <i>interactive development</i>, a.k.a. <i>conversational programming</i>.<br>
</p>

<p>
Can you get started without huge ceremonies and fumbling for days?<br>
</p>
</div>
</div>
