blog/best-programming-language-for-beginner.essay.org
** Static vs. Dynamic Typing

You may have heard of this distinction, and you've also may have heard that "dynamic" languages are better for beginners. Spoiler: It think that is bad advice.

When faced with the choice between "dynamic" and "static," one might be inclined to favor "dynamic" for its implication of speed and agility. On the other hand, "static" may seem dull and the lame corner, right? Well, the words carry a misleading conotation through their use in everyday life and may suggest a misguided conclusion:

The terms "static" and "dynamic" actually come from /[[https://en.wikipedia.org/wiki/Static_program_analysis][static analysis]]/ and /[[https://en.wikipedia.org/wiki/Dynamic_program_analysis][dynamic analysis]]/, which says something about /when/ certain properties of a program will be checked; here, it's about the data types (eg. string, integer, float, boolean and custom data types).

Both approaches carry benefits and tradeoffs, and I will mention those who are especially relevant for beginners:

*** Dynamically typed Languages
The data types will be checked /while the program runs/ – at runtime. That means your program may run and pretend that everything is fine, until it crashes unexpectedly when it encounters a type error.

- With a dynamically typed language, we're never quite sure what kind of value we're dealing with, until it hits us at runtime. They offer more flexibility and can be faster for prototyping, thanks to their tolerance for sloppy thinking. However, this can result in technical debt, as the forethought you didn't put in up front will catch up with you later on. In other words, it's easy to get carried away, putting off work for later and ending up with a mess. And because there's usually no time afterwards for necessary untangling, the mess stays around.

*** Statically typed Languages
The data types will be checked by the type checker /before the program runs/ — at compile time. The code will not even compile until the type errors have been adressed. This behavior can lead to frustration, but that's only because there's something wrong.

- Type annotations act as a concise, reliable documentation. You know instantly what a function does, what goes in and what comes out, without any guesswork.
- Quite often you'll just have to puzzle together what fits to what. That's quite helpful when you're using a library, and want to know how to stick it together with the rest of your code.
- Static typing helps to catch errors quickly. It prevents a whole class of potential bugs sneaking into the code. There is this saying "If it compiles, it's probably correct", and it's true more often than not (but a type checker can't protect you from logic errors).
- Refactoring! The joy of rewriting your code over and over again in pursuit of the perfect implementation --- as a novice, this is the highest pleasure of them all. Static typing helps your editor to tell you what else has to be changed, and where.

** Popularity and Commmunity

#+ATTR_HTML: :cite http://www.paulgraham.com/iflisp.html
#+BEGIN_QUOTE
"Popularity is always self-perpetuating, but it's especially so in programming languages. More libraries get written for popular languages, which makes them still more popular. Programs often have to work with existing programs, and this is easier if they're written in the same language, so languages spread from program to program like a virus. And managers prefer popular languages, because they give them more leverage over developers, who can more easily be replaced."
@@html:<cite>@@—[[http://www.paulgraham.com/iflisp.html][Paul Graham]]@@html:</cite>@@
#+END_QUOTE

Popular means just that: popular. It does not imply "technically superior" or "easy" or "getting a job": if everyone does it, why should they need you so badly? There'll always be someone better and cheaper. Also: Today's popular is tomorrow's most hated: Just two recent examples: Java and PHP. Popularity can diminish very quickly, so don't chase the hype (you're already too late anyway). [[https://cscalfani.medium.com/the-problem-with-popular-programming-languages-67faa14ac13b][Side read: The Problem with Popular Programming Languages]]

Popular languages have some benefits though — for instance bigger ecosystems, which leads to many things built around the language to make the life of (experienced) programmers easier. Obviously, popular languages have also bigger communities.

You don't need a huge community; smaller communities have their benefits, too. But it should be a welcoming one. Can you spot growth mindset and excitement?

So, 700,000 people fullmoon rave or beach party with friends? Meh, forget both and practice some social distancing – it's +quite popular+ in high demand still!

** Which Programming Language will be in high Demand

… in late autumn 2029 so I can get filthy rich coding it? Well, nobody knows and it doesn't matter. Why? /Because it's about learning to code/ – which is a timeless skill – not about a particular language. These come and go.

It's a bit like being able to ride a bicycle. Once you've learned the underlying principle, it will not make much of a difference if you hop on Grandma's grinder or shred your neighbour's toddler's tricycle, and you won't care if the current trend says in 10 years everyone will ride tiny mountain bikes with pink tyres.

*** But isn't there anything future proof? I'm investing so much Time!

The best future investment is [[https://www.youtube.com/watch?v=Kz_brQBl8xk][how to learn things on your own]].

Language-feature-wise, there's in fact a thing that's getting more and more important, and that is +concurrency+ [[https://medium.com/@itIsMadhavan/concurrency-vs-parallelism-a-brief-review-b337c8dac350][parallelism]]. Most languages in use today have been developed years ago when [[https://en.wikipedia.org/wiki/Moore%27s_law][Moore's Law]] was still valid. Back then, everyone expected single processors getting faster and faster, so it was perfectly fine to have languages to make programs running on a single processor/core, and no one really cared to build in parallelism features.

But that is not any more. To keep up with the demands of modern applications, we have no other chance than to put more processors/cores into a computer, or to run the application distributed on multiple computers. To leverage the power of multi-core processors, we need to be able to program our software conveniently in a way to utilize all available cores. It may be a good idea to learn a programming language which is designed to build programs that run tasks in parallel.

