blog/best-programming-language-for-beginner.essay.html
<div id="outline-container-org097002b" class="outline-3">
<h3 id="org097002b"><a href="#org097002b">Static vs. Dynamic Typing</a></h3>
<div class="outline-text-3" id="text-org097002b">
<p>
You may have heard of this distinction, and you&rsquo;ve also may have heard that &ldquo;dynamic&rdquo; languages are better for beginners. Spoiler: It think that is bad advice.<br>
</p>

<p>
When faced with the choice between &ldquo;dynamic&rdquo; and &ldquo;static,&rdquo; one might be inclined to favor &ldquo;dynamic&rdquo; for its implication of speed and agility. On the other hand, &ldquo;static&rdquo; may seem dull and the lame corner, right? Well, the words carry a misleading conotation through their use in everyday life and may suggest a misguided conclusion:<br>
</p>

<p>
The terms &ldquo;static&rdquo; and &ldquo;dynamic&rdquo; actually come from <i><a href="https://en.wikipedia.org/wiki/Static_program_analysis">static analysis</a></i> and <i><a href="https://en.wikipedia.org/wiki/Dynamic_program_analysis">dynamic analysis</a></i>, which says something about <i>when</i> certain properties of a program will be checked; here, it&rsquo;s about the data types (eg. string, integer, float, boolean and custom data types).<br>
</p>

<p>
Both approaches carry benefits and tradeoffs, and I will mention those who are especially relevant for beginners:<br>
</p>
</div>
<div id="outline-container-orgfba460e" class="outline-4">
<h4 id="orgfba460e"><a href="#orgfba460e">Dynamically typed Languages</a></h4>
<div class="outline-text-4" id="text-orgfba460e">
<p>
The data types will be checked <i>while the program runs</i> – at runtime. That means your program may run and pretend that everything is fine, until it crashes unexpectedly when it encounters a type error.<br>
</p>

<ul class="org-ul">
<li>With a dynamically typed language, we&rsquo;re never quite sure what kind of value we&rsquo;re dealing with, until it hits us at runtime. They offer more flexibility and can be faster for prototyping, thanks to their tolerance for sloppy thinking. However, this can result in technical debt, as the forethought you didn&rsquo;t put in up front will catch up with you later on. In other words, it&rsquo;s easy to get carried away, putting off work for later and ending up with a mess. And because there&rsquo;s usually no time afterwards for necessary untangling, the mess stays around.<br></li>
</ul>
</div>
</div>
<div id="outline-container-org4ccb5c5" class="outline-4">
<h4 id="org4ccb5c5"><a href="#org4ccb5c5">Statically typed Languages</a></h4>
<div class="outline-text-4" id="text-org4ccb5c5">
<p>
The data types will be checked by the type checker <i>before the program runs</i> — at compile time. The code will not even compile until the type errors have been adressed. This behavior can lead to frustration, but that&rsquo;s only because there&rsquo;s something wrong.<br>
</p>

<ul class="org-ul">
<li>Type annotations act as a concise, reliable documentation. You know instantly what a function does, what goes in and what comes out, without any guesswork.<br></li>
<li>Quite often you&rsquo;ll just have to puzzle together what fits to what. That&rsquo;s quite helpful when you&rsquo;re using a library, and want to know how to stick it together with the rest of your code.<br></li>
<li>Static typing helps to catch errors quickly. It prevents a whole class of potential bugs sneaking into the code. There is this saying &ldquo;If it compiles, it&rsquo;s probably correct&rdquo;, and it&rsquo;s true more often than not (but a type checker can&rsquo;t protect you from logic errors).<br></li>
<li>Refactoring! The joy of rewriting your code over and over again in pursuit of the perfect implementation &#x2014; as a novice, this is the highest pleasure of them all. Static typing helps your editor to tell you what else has to be changed, and where.<br></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga20af52" class="outline-3">
<h3 id="orga20af52"><a href="#orga20af52">Popularity and Commmunity</a></h3>
<div class="outline-text-3" id="text-orga20af52">
<blockquote cite="http://www.paulgraham.com/iflisp.html">
<p>
&ldquo;Popularity is always self-perpetuating, but it&rsquo;s especially so in programming languages. More libraries get written for popular languages, which makes them still more popular. Programs often have to work with existing programs, and this is easier if they&rsquo;re written in the same language, so languages spread from program to program like a virus. And managers prefer popular languages, because they give them more leverage over developers, who can more easily be replaced.&rdquo;<br>
<cite>—<a href="http://www.paulgraham.com/iflisp.html">Paul Graham</a></cite><br>
</p>
</blockquote>

<p>
Popular means just that: popular. It does not imply &ldquo;technically superior&rdquo; or &ldquo;easy&rdquo; or &ldquo;getting a job&rdquo;: if everyone does it, why should they need you so badly? There&rsquo;ll always be someone better and cheaper. Also: Today&rsquo;s popular is tomorrow&rsquo;s most hated: Just two recent examples: Java and PHP. Popularity can diminish very quickly, so don&rsquo;t chase the hype (you&rsquo;re already too late anyway). <a href="https://cscalfani.medium.com/the-problem-with-popular-programming-languages-67faa14ac13b">Side read: The Problem with Popular Programming Languages</a><br>
</p>

<p>
Popular languages have some benefits though — for instance bigger ecosystems, which leads to many things built around the language to make the life of (experienced) programmers easier. Obviously, popular languages have also bigger communities.<br>
</p>

<p>
You don&rsquo;t need a huge community; smaller communities have their benefits, too. But it should be a welcoming one. Can you spot growth mindset and excitement?<br>
</p>

<p>
So, 700,000 people fullmoon rave or beach party with friends? Meh, forget both and practice some social distancing – it&rsquo;s <del>quite popular</del> in high demand still!<br>
</p>
</div>
</div>
<div id="outline-container-orgaba0d9f" class="outline-3">
<h3 id="orgaba0d9f"><a href="#orgaba0d9f">Which Programming Language will be in high Demand</a></h3>
<div class="outline-text-3" id="text-orgaba0d9f">
<p>
… in late autumn 2029 so I can get filthy rich coding it? Well, nobody knows and it doesn&rsquo;t matter. Why? <i>Because it&rsquo;s about learning to code</i> – which is a timeless skill – not about a particular language. These come and go.<br>
</p>

<p>
It&rsquo;s a bit like being able to ride a bicycle. Once you&rsquo;ve learned the underlying principle, it will not make much of a difference if you hop on Grandma&rsquo;s grinder or shred your neighbour&rsquo;s toddler&rsquo;s tricycle, and you won&rsquo;t care if the current trend says in 10 years everyone will ride tiny mountain bikes with pink tyres.<br>
</p>
</div>
<div id="outline-container-orgacd9f56" class="outline-4">
<h4 id="orgacd9f56"><a href="#orgacd9f56">But isn&rsquo;t there anything future proof? I&rsquo;m investing so much Time!</a></h4>
<div class="outline-text-4" id="text-orgacd9f56">
<p>
The best future investment is <a href="https://www.youtube.com/watch?v=Kz_brQBl8xk">how to learn things on your own</a>.<br>
</p>

<p>
Language-feature-wise, there&rsquo;s in fact a thing that&rsquo;s getting more and more important, and that is <del>concurrency</del> <a href="https://medium.com/@itIsMadhavan/concurrency-vs-parallelism-a-brief-review-b337c8dac350">parallelism</a>. Most languages in use today have been developed years ago when <a href="https://en.wikipedia.org/wiki/Moore%27s_law">Moore&rsquo;s Law</a> was still valid. Back then, everyone expected single processors getting faster and faster, so it was perfectly fine to have languages to make programs running on a single processor/core, and no one really cared to build in parallelism features.<br>
</p>

<p>
But that is not any more. To keep up with the demands of modern applications, we have no other chance than to put more processors/cores into a computer, or to run the application distributed on multiple computers. To leverage the power of multi-core processors, we need to be able to program our software conveniently in a way to utilize all available cores. It may be a good idea to learn a programming language which is designed to build programs that run tasks in parallel.<br>
</p>
</div>
</div>
</div>
