blog/best-programming-language-for-beginner.essay.org
** Maturity

While it may be tempting to begin with the new hyped language everyone is raving about, a mature programming language has the benefit of an organically grown user base, flaws ironed out, stuff being written about it, better tooling, etc.

A mature language doesn't change every couple of months, so you can be sure to learn the "right" things – you don't have to worry if you're learning old stuff without knowing (looking at you, JavaScript).

Which language has been around for quite a while, but implements modern, interesting and useful concepts that may be relevant in the future?

** What kind of Animal are you?

It seems there are two different groups of programmers. Those that see programming languages primarily as a means of production (category 1) and those who see it as instrument of human reason (categories 2 and 3):

1. *Pragmatic languages:* conservative, efficient, worse-is-better, boring.
  /"A programming language is a tool to get the job done"/
2. *Hackish languages:* multi-paradigm, anything goes, flexibility, unopinionated.
  /"I pursue absolute freedom and like to explore the problem domain interactively"/
3. *Constraining languages:* single-paradigm, protecting you from yourself, the-right-thing, opinionated.
  /"I prefer one correct way according a fixed set of rules"/

Programming languages are created by different minds, within different eras, significantly influenced by fashion. One language may be a natural fit for a certain personality type, and a less fortunate choice for another. That even applies to programming itself – it's easier for some and harder for others (doesn't mean those are more stupid – ok, some really are).

* Choose your Poison

Some of them are actually better teaching languages, while others not so good and now I'll explain why. But be aware: that all of them suck in some way or another. By the way, the order of appearance is just for dramaturgical purposes and does not imply any [[*Mkay, but which one?][ranking]].

** ANSI C as Your First Programming Language

Welcome to the low-level. Programs written in C tend to be more performant than programs written in other languages. In other words, it is the fastest (practical) programming language. Performance-critical algorithms and systems are often written in a low-level-language like C; e. g. the Linux kernel, drivers, high-performance libraries, etc.

There seems to be a tradeoff with programming languages:
- either high run-time performance (fast) plus low programmer productivity → longer development time
- or lower run-time performance (slow) but higher programmer productivity → shorter development time

Development time (human) is more expensive than run-time time (computer), so mostly we agree on a slower programming language to minimize the human effort. However, since performance is a matter of the implementation and not the programming language per se, it is ... a myth. There are really fast high level programming languages coming close to C performance; [[*OCaml as Your First Programming Language][OCaml]] for instance.

You may hear here and there that one must learn programming in C before even thinking about anything else – well, no. It is true that C code is in the underpinnings of almost every system nowadays, yes – because most programming languages are not written in themselves, but in C. But there is no need to learn C as your first language: Start only with C if your main interest lies in electronics and [[https://en.wikipedia.org/wiki/Systems_programming][systems programming]], or you have some other reason to work very close to the machine.

If you wanna become that crazy hardware hacker, you may look into the [[https://www.arduino.cc/en/Guide/Introduction][Arduino electronics platform]], coming with the Arduino programming language (which is basically a subset of C). Don't confuse C with C++ (an extension to C, but huge and messy) or C# (a Microsoft thing). /Look for "ANSI C"/, the standard.

- [[https://learnxinyminutes.com/docs/c/][C code examples]]
- [[https://en.wikipedia.org/wiki/C_(programming_language)][Getting startet with C]] or [[https://www.arduino.cc/en/Guide][Arduino]]
- C programming book for beginners:
  - [[https://amzn.to/2XqQtag][The C Programming Language, 2nd Edition (paper/Kindle)]]
  - [[https://amzn.to/3ht17Ej][Beginning C for Arduino, Second Edition (paper/Kindle)]]

** Lua as Your First Programming Language

On the surface, Lua is quite similar to JavaScript – just without the ugly parts (more about that later). Lua is elegant, performant, carefully designed and consistent. Therefore it is super easy to learn for +Muggles+ Non-programmers, and probably the "easiest" programming language listed here.

Why is Lua an "easy language"? First, it is compact: There are not a lot of concepts or features to learn before you can do something meaningful. But then you can go on and combine the small set of building blocks with each other in many ways to implement more sophisticated things. Lua is probably the most simliar language to the Scheme programming language.

Lua is used in many domains, especially in the game industry (e. g. World of Warcraft, Roblox). Lua can be a high-level counterpart to C and can be embedded into C program code, so that high-level program logic – like character behavior – can be scripted in Lua, while the other parts of the software in need for raw metal speed can be written in C or C++.

It's straightforward to get started and build something with Lua: You might want to make your own 2D game with the Löve game engine, or you could use it to code native games and other apps for Android. There's a really nice IDE ("Integrated Development Environment") for Lua programming, called "ZeroBrane Studio"; think of it as an extended editor especially for Lua.

As far as I know, there are not many textbooks available, but you can use /the/ book written by Lua's chief architect Roberto Ierusalimschy. And there's a wiki and many many user tutorials. Lua is primarily developed at the University of Rio de Janeiro (PUC-Rio). Once you've committed to learn Lua, I recommend to buy the 4th edition to support the project.

- [[https://learnxinyminutes.com/docs/lua/][Lua code examples]]
- [[https://www.lua.org/start.html][Getting started with Lua]], [[https://studio.zerobrane.com/][ZeroBrane Studio]] and the [[https://love2d.org/][Löve game engine]]
- Lua programming books for beginners:
  - [[https://www.lua.org/pil/contents.html]["Programming in Lua 1st Edition" (free online)]]
  - [[https://store.feistyduck.com/products/programming-in-lua-fourth-edition-ebook]["Programming in Lua 4th Edition" (e-book)]] | [[https://amzn.to/3clCl6k][Paper book]]

