blog/best-programming-language-for-beginner.essay.html
<div id="outline-container-orgfeff84f" class="outline-3">
<h3 id="orgfeff84f"><a href="#orgfeff84f">Maturity</a></h3>
<div class="outline-text-3" id="text-orgfeff84f">
<p>
While it may be tempting to begin with the new hyped language everyone is raving about, a mature programming language has the benefit of an organically grown user base, flaws ironed out, stuff being written about it, better tooling, etc.<br>
</p>

<p>
A mature language doesn&rsquo;t change every couple of months, so you can be sure to learn the &ldquo;right&rdquo; things – you don&rsquo;t have to worry if you&rsquo;re learning old stuff without knowing (looking at you, JavaScript).<br>
</p>

<p>
Which language has been around for quite a while, but implements modern, interesting and useful concepts that may be relevant in the future?<br>
</p>
</div>
</div>
<div id="outline-container-orgc0235f6" class="outline-3">
<h3 id="orgc0235f6"><a href="#orgc0235f6">What kind of Animal are you?</a></h3>
<div class="outline-text-3" id="text-orgc0235f6">
<p>
It seems there are two different groups of programmers. Those that see programming languages primarily as a means of production (category 1) and those who see it as instrument of human reason (categories 2 and 3):<br>
</p>

<ol class="org-ol">
<li><b>Pragmatic languages:</b> conservative, efficient, worse-is-better, boring.<br>
<i>&ldquo;A programming language is a tool to get the job done&rdquo;</i><br></li>
<li><b>Hackish languages:</b> multi-paradigm, anything goes, flexibility, unopinionated.<br>
<i>&ldquo;I pursue absolute freedom and like to explore the problem domain interactively&rdquo;</i><br></li>
<li><b>Constraining languages:</b> single-paradigm, protecting you from yourself, the-right-thing, opinionated.<br>
<i>&ldquo;I prefer one correct way according a fixed set of rules&rdquo;</i><br></li>
</ol>

<p>
Programming languages are created by different minds, within different eras, significantly influenced by fashion. One language may be a natural fit for a certain personality type, and a less fortunate choice for another. That even applies to programming itself – it&rsquo;s easier for some and harder for others (doesn&rsquo;t mean those are more stupid – ok, some really are).<br>
</p>
</div>
</div>
</div>
<div id="outline-container-org73f78f0" class="outline-2">
<h2 id="org73f78f0"><a href="#org73f78f0">Choose your Poison</a></h2>
<div class="outline-text-2" id="text-org73f78f0">
<p>
Some of them are actually better teaching languages, while others not so good and now I&rsquo;ll explain why. But be aware: that all of them suck in some way or another. By the way, the order of appearance is just for dramaturgical purposes and does not imply any <a href="#org7a7df44">ranking</a>.<br>
</p>
</div>
<div id="outline-container-orga2c515b" class="outline-3">
<h3 id="orga2c515b"><a href="#orga2c515b">ANSI C as Your First Programming Language</a></h3>
<div class="outline-text-3" id="text-orga2c515b">
<p>
Welcome to the low-level. Programs written in C tend to be more performant than programs written in other languages. In other words, it is the fastest (practical) programming language. Performance-critical algorithms and systems are often written in a low-level-language like C; e. g. the Linux kernel, drivers, high-performance libraries, etc.<br>
</p>

<p>
There seems to be a tradeoff with programming languages:<br>
</p>
<ul class="org-ul">
<li>either high run-time performance (fast) plus low programmer productivity → longer development time<br></li>
<li>or lower run-time performance (slow) but higher programmer productivity → shorter development time<br></li>
</ul>

<p>
Development time (human) is more expensive than run-time time (computer), so mostly we agree on a slower programming language to minimize the human effort. However, since performance is a matter of the implementation and not the programming language per se, it is &#x2026; a myth. There are really fast high level programming languages coming close to C performance; <a href="#orgddf95ec">OCaml</a> for instance.<br>
</p>

<p>
You may hear here and there that one must learn programming in C before even thinking about anything else – well, no. It is true that C code is in the underpinnings of almost every system nowadays, yes – because most programming languages are not written in themselves, but in C. But there is no need to learn C as your first language: Start only with C if your main interest lies in electronics and <a href="https://en.wikipedia.org/wiki/Systems_programming">systems programming</a>, or you have some other reason to work very close to the machine.<br>
</p>

<p>
If you wanna become that crazy hardware hacker, you may look into the <a href="https://www.arduino.cc/en/Guide/Introduction">Arduino electronics platform</a>, coming with the Arduino programming language (which is basically a subset of C). Don&rsquo;t confuse C with C++ (an extension to C, but huge and messy) or C# (a Microsoft thing). <i>Look for &ldquo;ANSI C&rdquo;</i>, the standard.<br>
</p>

<ul class="org-ul">
<li><a href="https://learnxinyminutes.com/docs/c/">C code examples</a><br></li>
<li><a href="https://en.wikipedia.org/wiki/C_(programming_language)">Getting startet with C</a> or <a href="https://www.arduino.cc/en/Guide">Arduino</a><br></li>
<li>C programming book for beginners:<br>
<ul class="org-ul">
<li><a href="https://amzn.to/2XqQtag">The C Programming Language, 2nd Edition (paper/Kindle)</a><br></li>
<li><a href="https://amzn.to/3ht17Ej">Beginning C for Arduino, Second Edition (paper/Kindle)</a><br></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org5d032c7" class="outline-3">
<h3 id="org5d032c7"><a href="#org5d032c7">Lua as Your First Programming Language</a></h3>
<div class="outline-text-3" id="text-org5d032c7">
<p>
On the surface, Lua is quite similar to JavaScript – just without the ugly parts (more about that later). Lua is elegant, performant, carefully designed and consistent. Therefore it is super easy to learn for <del>Muggles</del> Non-programmers, and probably the &ldquo;easiest&rdquo; programming language listed here.<br>
</p>

<p>
Why is Lua an &ldquo;easy language&rdquo;? First, it is compact: There are not a lot of concepts or features to learn before you can do something meaningful. But then you can go on and combine the small set of building blocks with each other in many ways to implement more sophisticated things. Lua is probably the most simliar language to the Scheme programming language.<br>
</p>

<p>
Lua is used in many domains, especially in the game industry (e. g. World of Warcraft, Roblox). Lua can be a high-level counterpart to C and can be embedded into C program code, so that high-level program logic – like character behavior – can be scripted in Lua, while the other parts of the software in need for raw metal speed can be written in C or C++.<br>
</p>

<p>
It&rsquo;s straightforward to get started and build something with Lua: You might want to make your own 2D game with the Löve game engine, or you could use it to code native games and other apps for Android. There&rsquo;s a really nice IDE (&ldquo;Integrated Development Environment&rdquo;) for Lua programming, called &ldquo;ZeroBrane Studio&rdquo;; think of it as an extended editor especially for Lua.<br>
</p>

<p>
As far as I know, there are not many textbooks available, but you can use <i>the</i> book written by Lua&rsquo;s chief architect Roberto Ierusalimschy. And there&rsquo;s a wiki and many many user tutorials. Lua is primarily developed at the University of Rio de Janeiro (PUC-Rio). Once you&rsquo;ve committed to learn Lua, I recommend to buy the 4th edition to support the project.<br>
</p>

<ul class="org-ul">
<li><a href="https://learnxinyminutes.com/docs/lua/">Lua code examples</a><br></li>
<li><a href="https://www.lua.org/start.html">Getting started with Lua</a>, <a href="https://studio.zerobrane.com/">ZeroBrane Studio</a> and the <a href="https://love2d.org/">Löve game engine</a><br></li>
<li>Lua programming books for beginners:<br>
<ul class="org-ul">
<li><a href="https://www.lua.org/pil/contents.html">&ldquo;Programming in Lua 1st Edition&rdquo; (free online)</a><br></li>
<li><a href="https://store.feistyduck.com/products/programming-in-lua-fourth-edition-ebook">&ldquo;Programming in Lua 4th Edition&rdquo; (e-book)</a> | <a href="https://amzn.to/3clCl6k">Paper book</a><br></li>
</ul></li>
</ul>
</div>
</div>
