blog/best-programming-language-for-beginner.essay.org
** Clojure as Your First Programming Language

As a total noob, I've been looking for a language with a simple syntax, because who wants to run into syntax errors all the time? Clojure is a member of the /Lisp/ family; those have in fact the cleanest syntax of all programming languages. Further, it seems to be an expressive general purpose language, and it's designed especially with concurrency in mind.

The language is built on top of the Java platform. Software built on Java can run on almost any major operating system. Clojure can be used for different things, even for artsy stuff. Just as an example: [[https://overtone.github.io/][you can do live coding and make algorithmic music]], and there are things like algo-raves (yup, that exists …).

It's also a practical language to build serious business software with, because it can use Java's enormous library ecosystem. And there's [[https://clojurescript.org/][ClojureScript]], a dialect of Clojure that compiles to JavaScript (so you won't have to write web apps in JavaScript).

The language is a fresh take on Lisp and well designed. But there's also that Java underbelly who sticks out everywhere, coming with it's own terminology. And that's the drawback – you'll have to use Java stuff pretty soon and swallow the bleak Java speak +for a deeper understanding of Clojure+ doing even basic things.

If you want to try anyway, I recommend the book "Clojure for the Brave and True"; ok the "humor" gets annoying pretty quickly, but I had a good start with it and some enlightening moments. Well, the book convinced me also to take a look at Emacs, and I'm a fanatic Emacs user since then.

- [[https://learnxinyminutes.com/docs/clojure/][Clojure code examples]]
- [[https://clojure.org/guides/getting_started][Getting started with Clojure]]
- Clojure programming book for beginners:
  - [[https://amzn.to/2ZZTL63]["Clojure for the Brave and True" (paper/Kindle)]]

** Common Lisp as Your First Programming Language

My initial reason for me to use a programming language wasn't to write applications. Actually I wanted just a better calculator. A REPL makes a way better calculator than the silly concept of an interface resembling a physical pocket calculator with big buttons and a single line display.

Well, here Lisp's functional notation felt really weird for doing arithmetik: Instead of ~10 + 3 + 4 + 6 + 7~ you write ~(+ 10 3 4 6 7)~. There are no operators, everything it's basically function application. The uniform syntax is easy to pick up. And it doesn't get in your way, so you can concentrate on the things that really matter. This also makes a couple of things easier, for instance writing programs who write programs ... well, that's more advanced, but one of Lisp's many selling points: metaprogramming.

I think the most compelling books and essays have been written on Lisp, and it has the best learning material I could find. Well, Lisp has been around for a while and is mature in any aspect.

What really fascinates me, is that Lisp is no obscure magic box, where you write some keywords and then something underneath does some things and you don't know what and why. Lisp is different: everything is built from a few simple pieces. That makes it quite straightforward to paint a mental picture how it actually works. It's low-level and high-level at the same time. Mindblowing!

The tooling is excellent and designed for interactive development. *There's a really nice [[https://apps.apple.com/us/app/cl-repl/id1511296102][App for iOS]] and [[https://play.google.com/store/apps/details?id=org.eql5.android.repl][Android]] called "CL REPL".* You can use it to tinker around when ever you feel like /"Damn, I wish I could write some Lisp right now!"/ You can. It's in fact a complete Common Lisp IDE with SLIME, the "Superior Lisp Interaction Mode for Emacs".

But usually you want it on your laptop. There are plugins for [[https://atom.io/packages/slima][Atom]], [[https://marketplace.visualstudio.com/items?itemName=ailisp.commonlisp-vscode][VSCode]] and [[https://github.com/vlime/vlime][Vim]], although I recommend Emacs, which is straightforward to install [[https://portacle.github.io/][via Portacle]], a ready-made bundle coming with everything you need. If you don't know Emacs yet, do:
1. Menu → "Options" → "Use CUA keys"
2. Menu → "Options" → "Save options"
– then copy & paste works like everywhere else.

- [[https://learnxinyminutes.com/docs/common-lisp/][Common Lisp code examples]]
- [[https://stevelosh.com/blog/2018/08/a-road-to-common-lisp/][Getting started with Common Lisp]] and [[https://portacle.github.io/][the Portacle IDE]]
- Lisp programming books for beginners:
  - [[https://amzn.to/308BHa0]["Common Lisp: A Gentle Introduction to Symbolic Computation" (paper/Kindle)]] | [[https://www.cs.cmu.edu/~dst/LispBook/book.pdf][Free PDF]]
  - [[https://amzn.to/3cwdnkW]["Land of Lisp" (paper/Kindle)]]

