blog/best-programming-language-for-beginner.essay.html
<div id="outline-container-orga76262a" class="outline-3">
<h3 id="orga76262a"><a href="#orga76262a">Clojure as Your First Programming Language</a></h3>
<div class="outline-text-3" id="text-orga76262a">
<p>
As a total noob, I&rsquo;ve been looking for a language with a simple syntax, because who wants to run into syntax errors all the time? Clojure is a member of the <i>Lisp</i> family; those have in fact the cleanest syntax of all programming languages. Further, it seems to be an expressive general purpose language, and it&rsquo;s designed especially with concurrency in mind.<br>
</p>

<p>
The language is built on top of the Java platform. Software built on Java can run on almost any major operating system. Clojure can be used for different things, even for artsy stuff. Just as an example: <a href="https://overtone.github.io/">you can do live coding and make algorithmic music</a>, and there are things like algo-raves (yup, that exists …).<br>
</p>

<p>
It&rsquo;s also a practical language to build serious business software with, because it can use Java&rsquo;s enormous library ecosystem. And there&rsquo;s <a href="https://clojurescript.org/">ClojureScript</a>, a dialect of Clojure that compiles to JavaScript (so you won&rsquo;t have to write web apps in JavaScript).<br>
</p>

<p>
The language is a fresh take on Lisp and well designed. But there&rsquo;s also that ugly Java underbelly who sticks out everywhere, coming with it&rsquo;s own terminology. And that&rsquo;s the drawback – you&rsquo;ll have to use Java stuff pretty soon and swallow the bleak Java speak <del>for a deeper understanding of Clojure</del> doing even basic things.<br>
</p>

<p>
If you want to try anyway, I recommend the book &ldquo;Clojure for the Brave and True&rdquo;; ok the &ldquo;humor&rdquo; gets annoying pretty quickly, but I had a good start with it and some enlightening moments. Well, the book convinced me also to take a look at Emacs, and I&rsquo;m a fanatic Emacs user since then.<br>
</p>

<ul class="org-ul">
<li><a href="https://learnxinyminutes.com/docs/clojure/">Clojure code examples</a><br></li>
<li><a href="https://clojure.org/guides/getting_started">Getting started with Clojure</a><br></li>
<li>Clojure programming book for beginners:<br>
<ul class="org-ul">
<li><a href="https://amzn.to/2ZZTL63">&ldquo;Clojure for the Brave and True&rdquo; (paper/Kindle)</a><br></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org226eb41" class="outline-3">
<h3 id="org226eb41"><a href="#org226eb41">Common Lisp as Your First Programming Language</a></h3>
<div class="outline-text-3" id="text-org226eb41">
<p>
My initial reason for me to use a programming language wasn&rsquo;t to write applications. Actually I wanted just a better calculator. A REPL makes a way better calculator than the silly concept of an interface resembling a physical pocket calculator with big buttons and a single line display.<br>
</p>

<p>
Well, here Lisp&rsquo;s functional notation felt really weird for doing arithmetik: Instead of <code>10 + 3 + 4 + 6 + 7</code> you write <code>(+ 10 3 4 6 7)</code>. There are no operators, everything it&rsquo;s basically function application. The uniform syntax is easy to pick up. And it doesn&rsquo;t get in your way, so you can concentrate on the things that really matter. This also makes a couple of things easier, for instance writing programs who write programs &#x2026; well, that&rsquo;s more advanced, but one of Lisp&rsquo;s many selling points: metaprogramming.<br>
</p>

<p>
I think the most compelling books and essays have been written on Lisp, and it has the best learning material I could find. Well, Lisp has been around for a while and is mature in any aspect.<br>
</p>

<p>
What really fascinates me, is that Lisp is no obscure magic box, where you write some keywords and then something underneath does some things and you don&rsquo;t know what and why. Lisp is different: everything is built from a few simple pieces. That makes it quite straightforward to paint a mental picture how it actually works. It&rsquo;s low-level and high-level at the same time. Mindblowing!<br>
</p>

<p>
The tooling is excellent and designed for interactive development. <b>There&rsquo;s a really nice <a href="https://apps.apple.com/us/app/cl-repl/id1511296102">App for iOS</a> and <a href="https://play.google.com/store/apps/details?id=org.eql5.android.repl">Android</a> called &ldquo;CL REPL&rdquo;.</b> You can use it to tinker around when ever you feel like <i>&ldquo;Damn, I wish I could write some Lisp right now!&rdquo;</i> You can. It&rsquo;s in fact a complete Common Lisp IDE with SLIME, the &ldquo;Superior Lisp Interaction Mode for Emacs&rdquo;.<br>
</p>

<p>
But usually you want it on your laptop. There are plugins for <a href="https://atom.io/packages/slima">Atom</a>, <a href="https://marketplace.visualstudio.com/items?itemName=ailisp.commonlisp-vscode">VSCode</a> and <a href="https://github.com/vlime/vlime">Vim</a>, although I recommend Emacs, which is straightforward to install <a href="https://portacle.github.io/">via Portacle</a>, a ready-made bundle coming with everything you need. If you don&rsquo;t know Emacs yet, do:<br>
</p>
<ol class="org-ol">
<li>Menu → &ldquo;Options&rdquo; → &ldquo;Use CUA keys&rdquo;<br></li>
<li>Menu → &ldquo;Options&rdquo; → &ldquo;Save options&rdquo;<br></li>
</ol>
<p>
– then copy &amp; paste works like everywhere else.<br>
</p>

<ul class="org-ul">
<li><a href="https://learnxinyminutes.com/docs/common-lisp/">Common Lisp code examples</a><br></li>
<li><a href="https://stevelosh.com/blog/2018/08/a-road-to-common-lisp/">Getting started with Common Lisp</a> and <a href="https://portacle.github.io/">the Portacle IDE</a><br></li>
<li>Lisp programming books for beginners:<br>
<ul class="org-ul">
<li><a href="https://amzn.to/308BHa0">&ldquo;Common Lisp: A Gentle Introduction to Symbolic Computation&rdquo; (paper/Kindle)</a> | <a href="https://www.cs.cmu.edu/~dst/LispBook/book.pdf">Free PDF</a><br></li>
<li><a href="https://amzn.to/3cwdnkW">&ldquo;Land of Lisp&rdquo; (paper/Kindle)</a><br></li>
</ul></li>
</ul>
</div>
</div>
