blog/best-programming-language-for-beginner.essay.org
** Scheme or Racket as Your First Programming Language

Pleasantly surprised by Clojure and Common Lisp, I've into other languages from the Lisp family. Scheme is commonly recommended to beginners, especially for those who are interested in computer science. [[https://www.micahcantor.com/blog/why-learn-racket/][Why learn Racket? A student's perspective]]

Like other Lisps, Scheme shares the same uniform list representation of source code (actually these are tree structures), which makes it easier to paint a mental picture of the program structure. There's no clutter, which I like.

Scheme is opinionated in so far to stay unopinionated – meaning, it's a clean slate and people are eager to keep it that way. It is a minimalist language and often considered as the most elegant and consistent programming language; that makes it excellent for learning, reasoning about computation and to design algorithms, but not so much for cranking out some commercial business stuff app.

Racket is a descendant of Scheme (it was called PLT Scheme before). But Racket is far from minimal. It has tons of features built in and you can think of Racket as "Scheme with batteries included", and it is also platform for programming language research.

Scheme can run on Racket, so even if you just want to learn the Scheme language, you can do it comfortably in Racket. That may sound a bit confusing, but it actually isn't. You'll see.

Further, Racket emphasizes "language oriented programming". It means you can design your own small (domain specific) programming languages for your particular application and then write your application in that language. But you don't have to – you can just use "normal" Racket like everyone else. So don't bother with that for now.

The most recommended book on (functional) programming is the classic "Structure and Interpretation of Computer Programs", abbreviatet "SICP". It was written as an introduction for computer science students at MIT, using Scheme. But for me it was a bit too much as a very first book. But check it out anyway, it's really philosophical.

I've also began to read "How to Design Programs", which is supposedly easier and often recommended to read before SICP, but found it a bit too earnest and dry. The other books are quite different. Personally I recommend "Simply Scheme", "The Little Schemer" and "Realm of Racket".

You can get started very easily with Scheme and Racket – one single install and go, no matter if you are on Windows, Linux or Mac. You don't even have to be familiar with the command line, because it comes with DrRacket, a friendly and easy to use programming environment (IDE).

- [[https://learnxinyminutes.com/docs/racket/][Racket code examples]]
- [[https://docs.racket-lang.org/quick/index.html][Getting started with Scheme or Racket and the DrRacket IDE]]
- Scheme programming books for beginners:
  - [[https://people.eecs.berkeley.edu/~bh/simply-toc.html]["Simply Scheme" (free online)]] | [[https://amzn.to/3cpR0gV][Paper book]]
  - [[https://amzn.to/2XXHsEL][The little Schemer (Paper book)]] | [[https://archive.org/download/Schemer/The%20Little%20Schemer.epub][Free PDF]]
- Racket programming books for beginners:
  - [[https://amzn.to/3gO29v8]["Realm of Racket: Learn to Program, One Game at a Time!" (paper/Kindle)]]
  - [[https://amzn.to/2XRBWDr]["How to Design Programs: An Introduction to Programming and Computing" (paper/Kindle)]] | [[https://htdp.org/2020-5-6/Book/index.html][Free online]]
- Introduction into computer science:
  - [[https://mitpress.mit.edu/sites/default/files/sicp/index.html]["Structure and Interpretation of Computer Programs" (free online)]] | [[https://amzn.to/2ZZBS7f][Paper book]]

** Elixir as Your First Programming Language

Elixir is a well designed, new language that runs on the Erlang platform. Elixir is pretty neat for writing little scripts and automating everyday's tasks. But actually, the Erlang platform has been built for distributed computing, like forever-running systems with millions of users. It's all about staying up and running, no matter what.

Developed at Ericsson, the Erlang platform has become not only a major building block of today's telecommunication networks. After Ericsson has open-sourced the Erlang platform, it has found a new area of application in web backends. So not only Your mobile provider's infrastructure runs likely on Erlang, but so do [[https://smartlogic.io/podcast/elixir-wizards/s6e8-fedorov/][WhatsApp]] and [[https://discord.com/blog/how-discord-scaled-elixir-to-5-000-000-concurrent-users][Discord]].

Unlike with other hosted languages (Clojure on Java, Elm on JavaScript, …), the underlying Erlang platform is no distraction at all. Quite the contrary, because the platform you deal with -- Erlang's virtual machine -- stays the same everywhere, no matter if you develop your application on Windows or MacOS, but run it on some Linux later. This saves you from a lot of pain in the ass. You'll come very far with Elixir, before you'll dive into the platform technology.

Besides Elixir and the Erlang platform, there's also Erlang the (original) language. And there are quite a few more languages that run on the Erlang platform, e.g. LFE "Lisp Flavoured Erlang" and Alpaca. But these are less beginner-friendly.

What I dislike about Elixir is that many constructs have 3-4 "shorthands" or special cases to write the same thing, a.k.a. "syntactic sugar". It looks a bit like the language designers couldn't decide what ideas to keep and what to throw out -- e.g. a function definition in one line has a different notation than one that spans multiple lines, and another one if function appears within a module or not.

Does it make sense to learn programming with Elixir? Most books only go through the language itself and it's features. There is not really "how to program" learning material available for absolute beginners, but that may change. The first book I listed below is quite short and covers some basics, and there's a gap between that and the second one, which requires some prior knowledge (but not much). 

- [[https://learnxinyminutes.com/docs/elixir/][Elixir code examples]]
- [[https://elixir-lang.org/getting-started/introduction.html][Getting started with Elixir]]
- Eixir programming books for beginners:
 - [[https://joyofelixir.com/toc.html][Joy of Elixir (free online)]]
 - [[https://amzn.to/3p1gCH9][Learn Functional Programming with Elixir (paper/Kindle)]]
 - [[https://elixirschool.com/en][Elixir School (free online)]]

