blog/best-programming-language-for-beginner.essay.html
<div id="outline-container-orgf9a5c4e" class="outline-3">
<h3 id="orgf9a5c4e"><a href="#orgf9a5c4e">Scheme or Racket as Your First Programming Language</a></h3>
<div class="outline-text-3" id="text-orgf9a5c4e">
<p>
Pleasantly surprised by Clojure and Common Lisp, I&rsquo;ve into other languages from the Lisp family. Scheme is commonly recommended to beginners, especially for those who are interested in computer science. <a href="https://www.micahcantor.com/blog/why-learn-racket/">Why learn Racket? A student&rsquo;s perspective</a><br>
</p>

<p>
Like other Lisps, Scheme shares the same uniform list representation of source code (actually these are tree structures), which makes it easier to paint a mental picture of the program structure. There&rsquo;s no clutter, which I like.<br>
</p>

<p>
Scheme is opinionated in so far to stay unopinionated – meaning, it&rsquo;s a clean slate and people are eager to keep it that way. It is a minimalist language and often considered as the most elegant and consistent programming language; that makes it excellent for learning, reasoning about computation and to design algorithms, but not so much for cranking out some commercial business stuff app.<br>
</p>

<p>
Racket is a descendant of Scheme (it was called PLT Scheme before). But Racket is far from minimal. It has tons of features built in and you can think of Racket as &ldquo;Scheme with batteries included&rdquo;, and it is also platform for programming language research.<br>
</p>

<p>
Scheme can run on Racket, so even if you just want to learn the Scheme language, you can do it comfortably in Racket. That may sound a bit confusing, but it actually isn&rsquo;t. You&rsquo;ll see.<br>
</p>

<p>
Further, Racket emphasizes &ldquo;language oriented programming&rdquo;. It means you can design your own small (domain specific) programming languages for your particular application and then write your application in that language. But you don&rsquo;t have to – you can just use &ldquo;normal&rdquo; Racket like everyone else. So don&rsquo;t bother with that for now.<br>
</p>

<p>
The most recommended book on (functional) programming is the classic &ldquo;Structure and Interpretation of Computer Programs&rdquo;, abbreviatet &ldquo;SICP&rdquo;. It was written as an introduction for computer science students at MIT, using Scheme. But for me it was a bit too much as a very first book. But check it out anyway, it&rsquo;s really philosophical.<br>
</p>

<p>
I&rsquo;ve also began to read &ldquo;How to Design Programs&rdquo;, which is supposedly easier and often recommended to read before SICP, but found it a bit too earnest and dry. The other books are quite different. Personally I recommend &ldquo;Simply Scheme&rdquo;, &ldquo;The Little Schemer&rdquo; and &ldquo;Realm of Racket&rdquo;.<br>
</p>

<p>
You can get started very easily with Scheme and Racket – one single install and go, no matter if you are on Windows, Linux or Mac. You don&rsquo;t even have to be familiar with the command line, because it comes with DrRacket, a friendly and easy to use programming environment (IDE).<br>
</p>

<ul class="org-ul">
<li><a href="https://learnxinyminutes.com/docs/racket/">Racket code examples</a><br></li>
<li><a href="https://docs.racket-lang.org/quick/index.html">Getting started with Scheme or Racket and the DrRacket IDE</a><br></li>
<li>Scheme programming books for beginners:<br>
<ul class="org-ul">
<li><a href="https://people.eecs.berkeley.edu/~bh/simply-toc.html">&ldquo;Simply Scheme&rdquo; (free online)</a> | <a href="https://amzn.to/3cpR0gV">Paper book</a><br></li>
<li><a href="https://amzn.to/2XXHsEL">The little Schemer (Paper book)</a> | <a href="https://archive.org/download/Schemer/The%20Little%20Schemer.epub">Free PDF</a><br></li>
</ul></li>
<li>Racket programming books for beginners:<br>
<ul class="org-ul">
<li><a href="https://amzn.to/3gO29v8">&ldquo;Realm of Racket: Learn to Program, One Game at a Time!&rdquo; (paper/Kindle)</a><br></li>
<li><a href="https://amzn.to/2XRBWDr">&ldquo;How to Design Programs: An Introduction to Programming and Computing&rdquo; (paper/Kindle)</a> | <a href="https://htdp.org/2020-5-6/Book/index.html">Free online</a><br></li>
</ul></li>
<li>Introduction into computer science:<br>
<ul class="org-ul">
<li><a href="https://mitpress.mit.edu/sites/default/files/sicp/index.html">&ldquo;Structure and Interpretation of Computer Programs&rdquo; (free online)</a> | <a href="https://amzn.to/2ZZBS7f">Paper book</a><br></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org0dac1ba" class="outline-3">
<h3 id="org0dac1ba"><a href="#org0dac1ba">Elixir as Your First Programming Language</a></h3>
<div class="outline-text-3" id="text-org0dac1ba">
<p>
Elixir is new language that runs on the Erlang platform. Elixir is mostly used for writing server-backends for web apps, but it&rsquo;s also pretty neat for writing little scripts and automating everyday&rsquo;s tasks.<br>
</p>

<p>
Developed at Ericsson, the Erlang platform has become not only a major building block of today&rsquo;s telecommunication networks. After Ericsson has open-sourced the Erlang platform, it has found a new area of application in web backends. So not only Your mobile provider&rsquo;s infrastructure runs likely on Erlang, but so do <a href="https://smartlogic.io/podcast/elixir-wizards/s6e8-fedorov/">WhatsApp</a> and <a href="https://discord.com/blog/how-discord-scaled-elixir-to-5-000-000-concurrent-users">Discord</a>.<br>
</p>

<p>
Unlike with other hosted languages (Clojure on Java, Elm on JavaScript, …), the underlying Erlang platform is no distraction at all. Quite the contrary, because the platform you deal with &#x2013; Erlang&rsquo;s virtual machine &#x2013; stays the same everywhere, no matter if you develop your application on Windows or MacOS, but run it on some Linux later. This saves you from a lot of pain in the ass. You&rsquo;ll come very far with Elixir, before you&rsquo;ll dive into the platform technology.<br>
</p>

<p>
Besides Elixir and the Erlang platform, there&rsquo;s also Erlang the (original) language. And there are quite a few more languages that run on the Erlang platform, e.g. LFE &ldquo;Lisp Flavoured Erlang&rdquo; and Alpaca. But these are less beginner-friendly.<br>
</p>

<p>
What I dislike about Elixir is that many constructs have 3-4 &ldquo;shorthands&rdquo; or special cases to write the same thing, a.k.a. &ldquo;syntactic sugar&rdquo;. It looks a bit like the language designers couldn&rsquo;t decide what ideas to keep and what to throw out &#x2013; so it is often less clear what you are looking at.<br>
</p>

<p>
Does it make sense to learn programming with Elixir? Most books only go through the language itself and it&rsquo;s features. There is not really &ldquo;how to program&rdquo; learning material available for absolute beginners, but that may change. The first book I listed below is quite short and covers some basics, and there&rsquo;s a gap between that and the second one, which requires some prior knowledge (but not much).<br>
</p>

<ul class="org-ul">
<li><a href="https://learnxinyminutes.com/docs/elixir/">Elixir code examples</a><br></li>
<li><a href="https://elixir-lang.org/getting-started/introduction.html">Getting started with Elixir</a><br></li>
<li>Eixir programming books for beginners:<br>
<ul class="org-ul">
<li><a href="https://joyofelixir.com/toc.html">Joy of Elixir (free online)</a><br></li>
<li><a href="https://amzn.to/3p1gCH9">Learn Functional Programming with Elixir (paper/Kindle)</a><br></li>
<li><a href="https://elixirschool.com/en">Elixir School (free online)</a><br></li>
</ul></li>
</ul>
</div>
</div>
