blog/best-programming-language-for-beginner.essay.org
** JavaScript as Your First Programming Language

With JavaScript, you can build all kind of things in the browser and show it to your internet friends, without having them to download or install anything. JavaScript is the only language browsers support directly, still – and that's why everybody and their dog's fleas are coding JavaScript.

JavaScript +is+ was an imperative language at the very heart, but you can write object-oriented and functional style too. JavaScript assimilates new features with each version and therefore it's getting bigger and bigger. Resistance is futile. Or is it?

The language has good tooling and is easy to start with, and you may have heard "all you need is a web browser and a text editor". Well, um, nope. That's not really the truth. Expect a lot exceptions, special cases and to work around the poor language design.

You'll need to learn to avoid the pitfalls, and using a [[https://eslint.org/][linter]] (that's a tool that checks your code and tells you where the problematic or deprecated parts are) is mandatory to prevent you from using probably harmful things and deprecated stuff.

For me, it's a verbose frankenstein language that's a pain to read. Of course there are the usual suspects who disagree and even "love" JavaScript. These people either don't know any better, or suffer from a variant of the Stockholm Syndrome. Honestly, all of that doesn't make it a good choice for a first time programmer, but many start to learn programming with JavaScript, unfortunally.

If you just would like to build web apps or browser games, you do have other choices (check out Elm down below) but eventually you need to know JavaScript – but don't learn it as your very first language.

- [[https://learnxinyminutes.com/docs/javascript/][JavaScript code examples]]
- [[https://developer.mozilla.org/en-US/docs/Learn/Getting_started_with_the_web/JavaScript_basics][Getting started with JavaScript]] and [[http://xahlee.info/js/javascript_basics.html][get a nice introduction with this tutorial]]
- JavaScript programming book for beginners:
  - [[https://amzn.to/2U0p4K6]["Eloquent JavaScript" (paper/Kindle)]] | [[https://eloquentjavascript.net][Free online]]

** Elm as Your First Programming Language

Elm is a descendant of OCaml and Haskell that compiles to JavaScript: You write your website's code in Elm, and then the Elm compiler writes the JavaScript for you, so that your web browser can run it. If that sounds like it makes no sense, think about it this way: All programming languages compile down to another language on a lower level anyway, and those again and again, until your code's representation is only 11010101. Elm is just another layer on top.

Why not writing JavaScript directly? Elm comes with a few interesting features: first and foremost a /static type system/ (like OCaml), which helps you to feel (more) sure about the correctness of your code (think: less undiscovered bugs). And you don't have to deal with JavaScripts screwed type conversion. Secondly, Elm is a pure functional programming language: That makes it's easier to reason about what code actually does. And it comes with /immutable values/: ever writhed in disgust when you saw ~x = x + 1~? Then Elm is for you (or other programming languages with immutable values).

The Elm syntax is simple and the Elm compiler famous for its helpful error messages – like a built-in teacher who pushes you gently into the right direction on your pre-defined path to statically typed functional programming. And you will learn one way how to structure your application: "The Elm Architecture".

That's why I consider Elm a good fit for first-time coders, despite the fact that it's still a very young and very specifig language that runs exclusively in the browser. Which in turn means you'll need to know HTML and CSS, at least at a basic level. There is not so much literature out there about Elm, but it opens the door to other functional programming languages, like OCaml or Haskell.

Elm comes with an easy installation and convenient tooling. The language is nicely designed as a whole piece, and it's quite opinionated: You'll need to do most things like intended by its creator, similar to Python. On the other hand that's one of the reasons why everything within the Elm ecosystem fits so well together.

If I like Elm but it's a browser-only language, why not learn "the real thing" – Haskell or OCaml?

- [[https://learnxinyminutes.com/docs/elm/][Elm code examples]]
- [[https://elm-lang.org/][Getting startet with Elm]]
- Elm programming book for beginners:
  - [[https://elmprogramming.com/]["Beginning Elm" (free online)]]

