blog/best-programming-language-for-beginner.essay.html
<div id="outline-container-org117ba7d" class="outline-3">
<h3 id="org117ba7d"><a href="#org117ba7d">JavaScript as Your First Programming Language</a></h3>
<div class="outline-text-3" id="text-org117ba7d">
<p>
With JavaScript, you can build all kind of things in the browser and show it to your internet friends, without having them to download or install anything. JavaScript is the only language browsers support directly, still – and that&rsquo;s why everybody and their dog&rsquo;s fleas are coding JavaScript.<br>
</p>

<p>
JavaScript is an imperative language at the very heart, but you can write object-oriented and functional style too. JavaScript assimilates new features with each version and therefore it&rsquo;s getting bigger and bigger. Resistance is futile. Or is it?<br>
</p>

<p>
The language has good tooling and is easy to start with, and you may have heard &ldquo;all you need is a web browser and a text editor&rdquo;. Well, um, nope. That&rsquo;s not really the truth. Expect a lot exceptions, special cases and to work around the poor language design.<br>
</p>

<p>
You&rsquo;ll need to learn to avoid the pitfalls, and using a <a href="https://eslint.org/">linter</a> (that&rsquo;s a tool that checks your code and tells you where the problematic or deprecated parts are) is mandatory to prevent you from using probably harmful things and deprecated stuff.<br>
</p>

<p>
For me, it&rsquo;s a verbose frankenstein language that&rsquo;s a pain to read. Of course there are the usual suspects who disagree and even &ldquo;love&rdquo; JavaScript. These people either don&rsquo;t know any better, or suffer from a variant of the Stockholm Syndrome. Honestly, all of that doesn&rsquo;t make it a good choice for a first time programmer, but many start to learn programming with JavaScript, unfortunally.<br>
</p>

<p>
If you just would like to build web apps or browser games, you do have other choices (check out Elm down below) but eventually you need to know JavaScript – but don&rsquo;t learn it as your very first language.<br>
</p>

<ul class="org-ul">
<li><a href="https://learnxinyminutes.com/docs/javascript/">JavaScript code examples</a><br></li>
<li><a href="https://developer.mozilla.org/en-US/docs/Learn/Getting_started_with_the_web/JavaScript_basics">Getting started with JavaScript</a> and <a href="http://xahlee.info/js/javascript_basics.html">get a nice introduction with this tutorial</a><br></li>
<li>JavaScript programming book for beginners:<br>
<ul class="org-ul">
<li><a href="https://amzn.to/2U0p4K6">&ldquo;Eloquent JavaScript&rdquo; (paper/Kindle)</a> | <a href="https://eloquentjavascript.net">Free online</a><br></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3e3031c" class="outline-3">
<h3 id="org3e3031c"><a href="#org3e3031c">Elm as Your First Programming Language</a></h3>
<div class="outline-text-3" id="text-org3e3031c">
<p>
Elm is a descendant of OCaml and Haskell that compiles to JavaScript: You write your website&rsquo;s code in Elm, and then the Elm compiler writes the JavaScript for you, so that your web browser can run it. If that sounds like it makes no sense, think about it this way: All programming languages compile down to another language on a lower level anyway, and those again and again, until your code&rsquo;s representation is only 11010101. Elm is just another layer on top.<br>
</p>

<p>
Why not writing JavaScript directly? Elm comes with a few interesting features: first and foremost a <i>static type system</i> (like OCaml), which helps you to feel (more) sure about the correctness of your code (think: less undiscovered bugs). And you don&rsquo;t have to deal with JavaScripts screwed type conversion. Secondly, Elm is a pure functional programming language: That makes it&rsquo;s easier to reason about what code actually does. And it comes with <i>immutable values</i>: ever writhed in disgust when you saw <code>x = x + 1</code>? Then Elm is for you (or other programming languages with immutable values).<br>
</p>

<p>
The Elm syntax is simple and the Elm compiler famous for its helpful error messages – like a built-in teacher who pushes you gently into the right direction on your pre-defined path to statically typed functional programming. And you will learn one way how to structure your application: &ldquo;The Elm Architecture&rdquo;.<br>
</p>

<p>
That&rsquo;s why I consider Elm a good fit for first-time coders, despite the fact that it&rsquo;s still a very young and very specifig language that runs exclusively in the browser. Which in turn means you&rsquo;ll need to know HTML and CSS, at least at a basic level. There is not so much literature out there about Elm, but it opens the door to other functional programming languages, like OCaml or Haskell.<br>
</p>

<p>
Elm comes with an easy installation and convenient tooling. The language is nicely designed as a whole piece, and it&rsquo;s quite opinionated: You&rsquo;ll need to do most things like intended by its creator, similar to Python. On the other hand that&rsquo;s one of the reasons why everything within the Elm ecosystem fits so well together.<br>
</p>

<p>
If I like Elm but it&rsquo;s a browser-only language, why not learn &ldquo;the real thing&rdquo; – Haskell or OCaml?<br>
</p>

<ul class="org-ul">
<li><a href="https://learnxinyminutes.com/docs/elm/">Elm code examples</a><br></li>
<li><a href="https://elm-lang.org/">Getting startet with Elm</a><br></li>
<li>Elm programming book for beginners:<br>
<ul class="org-ul">
<li><a href="https://elmprogramming.com/">&ldquo;Beginning Elm&rdquo; (free online)</a><br></li>
</ul></li>
</ul>
</div>
</div>
